import math

#绝对值
a=abs(-1)
print(a)

a=math.fabs(-2)
print(a)


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#向上取整
print(math.ceil(-45.17))
print(math.ceil(100.12))

print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")

#向下取整
print(math.floor(-45.17))
print(math.floor(100.12))


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#如果 x < y 返回 -1, 如果 x == y 返回 0, 如果 x > y 返回 1
a=(4>6)-(4<6)
print(a)


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#e的x次幂
a=math.exp(1)
print(a)


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#最大数
a=max(-1,1,24,6,7,443,3)
print(a)


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#最大数
a=min(-1,1,24,6,7,443,3)
print(a)


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#返回 xy（x的y次方）
print (math.pow(100, 2))
print (pow(100, 2)) # 使用内置，查看输出结果区别


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")


#返回浮点数x的四舍五入值
print (round(70.23456))


print("\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n")



#返回数字x的平方根
print (math.sqrt(100))



